tap "daipeihust/tap"
tap "discoteq/discoteq"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "laishulu/homebrew"
tap "riscv/riscv"
tap "sst/tap"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "atool"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "glib"
brew "lzo"
brew "cairo"
brew "harfbuzz"
brew "bazel"
brew "bazelisk", link: false
brew "bc"
brew "grpc"
brew "bear"
brew "bison"
brew "boost"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "btop"
brew "ccache"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "colormake"
brew "coreutils"
brew "ctags"
brew "libssh2"
brew "curl"
brew "delve"
brew "docker"
brew "double-conversion"
brew "duckdb"
brew "elinks"
brew "exiftool"
brew "expat"
brew "fd"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "pango"
brew "snappy"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "flex"
brew "flock"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gd"
brew "gdk-pixbuf"
brew "gflags"
brew "gh"
brew "ghostscript"
brew "git"
brew "glog"
brew "gnu-sed"
brew "libusb"
brew "gnupg"
brew "golangci-lint"
brew "gotests"
brew "gperf"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "highlight"
brew "libraw"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "lazygit"
brew "libcaca"
brew "libmediainfo"
brew "libpq"
brew "libslirp"
brew "libuv"
brew "libzip"
brew "llvm"
brew "lua-language-server"
brew "luarocks"
brew "lynx"
brew "macvim"
brew "openjdk"
brew "maven"
brew "media-info"
brew "minimal-racket"
brew "mtr"
brew "mysql", restart_service: :changed
brew "mysql-client@8.4"
brew "mysql@8.4", restart_service: :changed
brew "neovim"
brew "neovim-remote", link: false
brew "ninja"
brew "openjdk@11"
brew "openjdk@17"
brew "patchutils"
brew "perl"
brew "pigz"
brew "pipx"
brew "poppler"
brew "protobuf@21"
brew "qemu"
brew "ripgrep"
brew "rsync"
brew "selene"
brew "sevenzip"
brew "shfmt"
brew "sl"
brew "smartmontools"
brew "sox"
brew "sqlfmt"
brew "stow"
brew "stylua"
brew "sysbench"
brew "texinfo"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "w3m"
brew "wget"
brew "wireguard-tools"
brew "yadm"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "daipeihust/tap/im-select"
brew "laishulu/homebrew/macism"
brew "riscv/riscv/riscv-gnu-toolchain"
brew "riscv/riscv/riscv-isa-sim"
brew "riscv/riscv/riscv-tools"
brew "sst/tap/opencode"
cask "iterm2"
cask "keycastr"
cask "xquartz"
vscode "13xforever.language-x86-64-assembly"
vscode "1943time.inkdown"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "anysphere.pyright"
vscode "ayanamists.ayaseditor"
vscode "basdp.language-gas-x86"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "daohong-emilio.yash"
vscode "davidanson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "dunstontc.vscode-go-syntax"
vscode "eamodio.gitlens"
vscode "evzen-wybitul.magic-racket"
vscode "fabiospampinato.vscode-diff"
vscode "formulahendry.vscode-mysql"
vscode "foxundermoon.shell-format"
vscode "geddski.macros"
vscode "gimenete.github-linker"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "ibm.output-colorizer"
vscode "jakob101.relativepath"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jscearcy.rust-doc-viewer"
vscode "lishizhen.racket-fmt"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msyrus.go-doc"
vscode "ohanedan.lowlight-go-errors"
vscode "quarto.quarto"
vscode "quillaja.goasm"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-icons-mac"
vscode "wisen.wisen-translate"
vscode "xaver.clang-format"
vscode "yinfei.luahelper"
vscode "zhwu95.riscv"
vscode "zxh404.vscode-proto3"
